Tekla Open API Reference for Tekla Structures 2025
Point Operators
The Point type exposes the following members.
Operators
Name | Description
Addition
 Returns the sum of the given two points.
Equality
 Compares the given two points for similarity.
Inequality
 Compares if the two given points are not similar.
Subtraction
 Returns the difference of the given two points.
Top
See Also
Reference
Point Class
Tekla.Structures.Geometry3d Namespace